from django.db import models

# Create your models here.



'''  এই মডেল ডেফিনিশন কোডটি ডি'জাঙ্গোতে পণ্যের তথ্য সংরক্ষণ করার জন্য ব্যবহৃত হয়। এই মডেলে চারটি ফিল্ড আছে: প্রোডাক্ট আইডি, প্রোডাক্ট নাম, বিবরণ এবং প্রকাশের তারিখ।   '''


class Product(models.Model):  #>  এটি একটি ক্লাস ডিফিনিশন শুরু করে, "Product" নামের একটি মডেল তৈরি করে।

    product_id = models.AutoField   #> এটি একটি ফিল্ড ডেফাইন করে, যা একটি অটোম্যাটিক ইনক্রিমেন্ট হয়ে যাবে। এটি প্রতিটি নতুন পণ্যের জন্য একটি অনন্য আইডি তৈরি করবে।
    product_name = models.CharField(max_length=50)   #> এটি একটি ফিল্ড ডেফাইন করে, যা টেক্সট ধরনের তথ্য সংরক্ষণ করবে এবং এর দৈর্ঘ্য সর্বাধিক ৫০ অক্ষর হতে পারবে|
    desc = models.CharField(max_length=300)   #> এটি আরেকটি ফিল্ড ডেফাইন করে, যা বিস্তারিত তথ্য সংরক্ষণ করবে এবং এর দৈর্ঘ্য সর্বাধিক ৩০০ অক্ষর হতে পারবে।
    pub_date = models.DateField() #> এটি একটি তারিখ ফিল্ড ডেফাইন করে, যা পণ্যের প্রকাশের তারিখ সংরক্ষণ করবে।















