
print()

print("=============> Front-end and Back-end  meaning.<================")
print()


"""
#############$$$$$$$$$ ওয়েবসাইটে ফ্রন্ট-এন্ড এবং ব্যাক-এন্ড হচ্ছে দুটি প্রধান অংশ।  $$$$$$$$$$$#################

# ফ্রন্ট-এন্ড হল ওয়েবসাইটের সেই অংশ যা ব্যবহারকারীর সামনে দেখা যায় , অর্থাৎ ওয়েবসাইটের বিভিন্ন অংশ যা ব্যবহারকারী ইন্টারফেস হিসেবে দেখতে পায়।
> ফ্রন্ট-এন্ড ডেভেলপমেন্ট করা হয় HTML, CSS, এবং JavaScript ব্যবহার করে। এটি ওয়েবসাইটের লেআউট, ডিজাইন, ব্যবহারকারীর ইন্টারফেস ইত্যাদি সৃষ্টি করে।




# ব্যাক-এন্ড হল ওয়েবসাইটের সেই অংশ যা ব্যবহারকারীর সামনে দেখা যায় না, কিন্তু ওয়েবসাইটের পেছনের অংশে ঘটনা ঘটায় 
> এটি সার্ভারের সাথে যুক্ত থাকে এবং ডাটাবেস, ব্যবহারকারীর তথ্য, ওয়েবসাইটের কাজ সম্পর্কে যত্নশীলভাবে সংরক্ষণ করে। 
> ব্যাক-এন্ড ডেভেলপমেন্ট এর জন্য বিভিন্ন প্রোগ্রামিং ভাষা এবং ফ্রেমওয়ার্ক ব্যবহার করা হয় যেগুলো সার্ভার সাইড কোডিং করার জন্য ব্যবহার হয়।


"""


with open('day3 = picture.png','r') as day3:
    a = day3.read()

    # print(a)






